----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\hiv-research\analysis\output/an_cumincidence.log
  log type:  text
 opened on:  28 Aug 2020, 17:38:21

. 
. use "cr_create_analysis_dataset_STSET_onsdeath_fail1", clear
(Analysis dataset HIV project)

. 
. *xi: stpm2 hiv i.ethnicity $adjustmentlist, df(3) scale(hazard) eform
. xi i.ethnicity i.male i.imd 
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)

. stpm2 hiv age1 age2 age3 _I*, df(3) scale(hazard) eform 

Iteration 0:   log likelihood = -71292.507  
Iteration 1:   log likelihood = -71285.257  
Iteration 2:   log likelihood = -71285.248  
Iteration 3:   log likelihood = -71285.248  

Log likelihood = -71285.248                     Number of obs     = 12,745,732

-------------------------------------------------------------------------------
              |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
xb            |
          hiv |   2.479692    .557728     4.04   0.000     1.595684    3.853439
         age1 |   1.168336     .02553     7.12   0.000     1.119355    1.219461
         age2 |   .9106672   .0430721    -1.98   0.048     .8300423    .9991235
         age3 |   1.269419   .1385676     2.19   0.029     1.024918    1.572246
_Iethnicity_2 |   1.672077   .1916552     4.48   0.000     1.335644    2.093253
_Iethnicity_3 |   1.672229   .0653823    13.15   0.000     1.548869    1.805414
_Iethnicity_4 |   1.875128   .1114275    10.58   0.000     1.668973    2.106749
_Iethnicity_5 |   1.414981   .1251674     3.92   0.000     1.189746    1.682855
     _Imale_1 |   1.661251    .031872    26.46   0.000     1.599943    1.724908
      _Iimd_2 |   1.202196   .0389112     5.69   0.000       1.1283    1.280931
      _Iimd_3 |   1.304784   .0419109     8.28   0.000     1.225172    1.389569
      _Iimd_4 |   1.718973   .0535685    17.38   0.000     1.617123    1.827238
      _Iimd_5 |   2.158719   .0668794    24.84   0.000     2.031538    2.293862
        _rcs1 |   2.365686   .0376891    54.05   0.000     2.292959    2.440721
        _rcs2 |   1.413314   .0109005    44.85   0.000     1.392111    1.434841
        _rcs3 |   .9847318   .0007347   -20.62   0.000     .9832928    .9861729
        _cons |   4.01e-08   3.19e-08   -21.42   0.000     8.45e-09    1.91e-07
-------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t | 17,308,294    143.6435    5.717096          1        144

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(17,308,622 missing values generated)

. stpm2_standsurv if hiv==1 & ethnicity<., at1(hiv 0) at2(hiv 1) timevar(timevar) ci contrast(difference) fail

. 
. gen date = d(1/2/2020)+ timevar
(17,308,622 missing values generated)

. format date %tddd_Month

. 
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci: replace X=100*X

->  replace _at1=100*_at1
(144 real changes made)

->  replace _at2=100*_at2
(144 real changes made)

->  replace _at1_lci=100*_at1_lci
(130 real changes made)

->  replace _at1_uci=100*_at1_uci
(130 real changes made)

->  replace _at2_lci=100*_at2_lci
(131 real changes made)

->  replace _at2_uci=100*_at2_uci
(131 real changes made)

. 
. l date timevar _at1 _at1_lci _at1_uci _at2 _at2_lci _at2_uci if timevar<.

          +-------------------------------------------------------------------------------------------------+
          |        date   timevar         _at1    _at1_lci    _at1_uci         _at2    _at2_lci    _at2_uci |
          |-------------------------------------------------------------------------------------------------|
       1. |  1 February         0            0           .           .            0           .           . |
       2. |  2 February         1   -9.770e-13           .           .   -1.044e-12           .           . |
       3. |  3 February         2   -9.770e-13           .           .   -1.044e-12           .           . |
       4. |  4 February         3   -9.770e-13           .           .   -1.044e-12           .           . |
       5. |  5 February         4   -9.770e-13           .           .   -1.044e-12           .           . |
          |-------------------------------------------------------------------------------------------------|
       6. |  6 February         5   -9.770e-13           .           .   -1.044e-12           .           . |
       7. |  7 February         6   -9.770e-13           .           .   -1.044e-12           .           . |
       8. |  8 February         7   -9.770e-13           .           .   -1.044e-12           .           . |
       9. |  9 February         8   -9.770e-13           .           .   -1.044e-12           .           . |
      10. | 10 February         9   -9.770e-13           .           .   -1.044e-12           .           . |
          |-------------------------------------------------------------------------------------------------|
      11. | 11 February        10   -9.770e-13           .           .   -1.044e-12           .           . |
      12. | 12 February        11   -9.770e-13           .           .   -1.021e-12           .           . |
      13. | 13 February        12   -9.548e-13           .           .   -9.548e-13           .           . |
      14. | 14 February        13   -9.104e-13           .           .   -7.994e-13           .           . |
      15. | 15 February        14   -6.661e-13           .           .    2.220e-14   9.891e-37   4.985e+08 |
          |-------------------------------------------------------------------------------------------------|
      16. | 16 February        15    3.886e-13   1.533e-14   9.851e-12    2.409e-12   5.695e-13   1.019e-11 |
      17. | 17 February        16    3.209e-12   1.073e-12   9.593e-12    9.603e-12   3.454e-12   2.670e-11 |
      18. | 18 February        17    1.090e-11   4.683e-12   2.538e-11    2.811e-11   1.114e-11   7.096e-11 |
      19. | 19 February        18    2.943e-11   1.356e-11   6.389e-11    7.372e-11   3.044e-11   1.785e-10 |
      20. | 20 February        19    7.341e-11   3.535e-11   1.525e-10    1.831e-10   7.840e-11   4.275e-10 |
          |-------------------------------------------------------------------------------------------------|
      21. | 21 February        20    1.739e-10   8.701e-11   3.477e-10    4.325e-10   1.911e-10   9.789e-10 |
      22. | 22 February        21    3.944e-10   2.042e-10   7.616e-10    9.781e-10   4.442e-10   2.153e-09 |
      23. | 23 February        22    8.584e-10   4.586e-10   1.607e-09    2.129e-09   9.920e-10   4.568e-09 |
      24. | 24 February        23    1.805e-09   9.929e-10   3.280e-09    4.475e-09   2.136e-09   9.374e-09 |
      25. | 25 February        24    3.676e-09   2.080e-09   6.495e-09    9.114e-09   4.451e-09   1.867e-08 |
          |-------------------------------------------------------------------------------------------------|
      26. | 26 February        25    7.272e-09   4.229e-09   1.251e-08    1.803e-08   8.995e-09   3.615e-08 |
      27. | 27 February        26    1.401e-08   8.360e-09   2.347e-08    3.473e-08   1.768e-08   6.825e-08 |
      28. | 28 February        27    2.632e-08   1.611e-08   4.301e-08    6.527e-08   3.385e-08   1.258e-07 |
      29. | 29 February        28    4.834e-08   3.030e-08   7.711e-08    1.199e-07   6.328e-08   2.270e-07 |
      30. |     1 March        29    8.689e-08   5.575e-08   1.354e-07    2.155e-07   1.157e-07   4.013e-07 |
          |-------------------------------------------------------------------------------------------------|
      31. |     2 March        30    1.531e-07   1.005e-07   2.334e-07    3.797e-07   2.071e-07   6.962e-07 |
      32. |     3 March        31    2.649e-07   1.776e-07   3.951e-07    6.568e-07   3.636e-07   1.186e-06 |
      33. |     4 March        32    4.497e-07   3.079e-07   6.570e-07    1.115e-06   6.260e-07   1.987e-06 |
      34. |     5 March        33    7.499e-07   5.238e-07   1.074e-06    1.860e-06   1.057e-06   3.270e-06 |
      35. |     6 March        34    1.228e-06   8.746e-07   1.725e-06    3.046e-06   1.753e-06   5.292e-06 |
          |-------------------------------------------------------------------------------------------------|
      36. |     7 March        35    1.977e-06   1.434e-06   2.725e-06    4.902e-06   2.854e-06   8.422e-06 |
      37. |     8 March        36    3.128e-06   2.310e-06   4.236e-06    7.757e-06   4.562e-06   .00001319 |
      38. |     9 March        37    4.867e-06   3.656e-06   6.479e-06    .00001207   7.166e-06   .00002032 |
      39. |    10 March        38    7.450e-06   5.689e-06   9.756e-06    .00001847   .00001107   .00003084 |
      40. |    11 March        39    .00001122   8.706e-06   .00001447    .00002783   .00001681   .00004608 |
          |-------------------------------------------------------------------------------------------------|
      41. |    12 March        40    .00001665   .00001311   .00002114    .00004128   .00002512   .00006786 |
      42. |    13 March        41    .00002433   .00001943   .00003046    .00006032   .00003694   .00009848 |
      43. |    14 March        42    .00003503   .00002836   .00004326    .00008685   .00005352   .00014094 |
      44. |    15 March        43    .00004972   .00004078   .00006061    .00012329   .00007639   .00019896 |
      45. |    16 March        44     .0000696    .0000578   .00008382     .0001726   .00010748   .00027716 |
          |-------------------------------------------------------------------------------------------------|
      46. |    17 March        45    .00009614   .00008078   .00011443     .0002384   .00014912   .00038113 |
      47. |    18 March        46    .00013108   .00011135    .0001543    .00032503   .00020412   .00051754 |
      48. |    19 March        47    .00017645   .00015147   .00020555    .00043754   .00027576   .00069422 |
      49. |    20 March        48    .00023462    .0002034   .00027064    .00058179   .00036784   .00092018 |
      50. |    21 March        49    .00030827   .00026973   .00035231     .0007644   .00048465   .00120562 |
          |-------------------------------------------------------------------------------------------------|
      51. |    22 March        50    .00040036   .00035336    .0004536    .00099274   .00063098    .0015619 |
      52. |    23 March        51    .00051413   .00045747   .00057781    .00127483   .00081204   .00200139 |
      53. |    24 March        52    .00065304   .00058546   .00072843    .00161928    .0010334   .00253733 |
      54. |    25 March        53    .00082073   .00074093   .00090912    .00203505   .00130088   .00318356 |
      55. |    26 March        54    .00102089   .00092755   .00112361    .00253131   .00162042   .00395423 |
          |-------------------------------------------------------------------------------------------------|
      56. |    27 March        55    .00125719   .00114898    .0013756     .0031172   .00199795   .00486345 |
      57. |    28 March        56    .00153321   .00140872   .00166869     .0038015   .00243913   .00592481 |
      58. |    29 March        57    .00185222   .00171004   .00200623    .00459238   .00294925   .00715094 |
      59. |    30 March        58    .00221715   .00205577   .00239119    .00549705   .00353296   .00855302 |
      60. |    31 March        59    .00263039   .00244824   .00282608    .00652143   .00419408   .01014025 |
          |-------------------------------------------------------------------------------------------------|
      61. |     1 April        60    .00309369    .0028891   .00331276    .00766984   .00493538   .01191934 |
      62. |     2 April        61    .00360803   .00337922   .00385235     .0089447    .0057584   .01389407 |
      63. |     3 April        62    .00417353   .00391859   .00444506    .01034624   .00666329   .01606486 |
      64. |     4 April        63    .00478932   .00450626   .00509015    .01187231   .00764861    .0184284 |
      65. |     5 April        64    .00545351   .00514029   .00578581    .01351819   .00871134   .02097743 |
          |-------------------------------------------------------------------------------------------------|
      66. |     6 April        65    .00616314   .00581771   .00652908    .01527653    .0098467   .02370058 |
      67. |     7 April        66    .00691419   .00653456   .00731587    .01713731   .01104821   .02658233 |
      68. |     8 April        67    .00770157   .00728592   .00814093     .0190879   .01230775   .02960312 |
      69. |     9 April        68     .0085192   .00806593   .00899794    .02111323   .01361558   .03273959 |
      70. |    10 April        69     .0093601   .00886796   .00987956    .02319598   .01496053   .03596485 |
          |-------------------------------------------------------------------------------------------------|
      71. |    11 April        70     .0102165   .00968464   .01077758    .02531687   .01633019   .03924902 |
      72. |    12 April        71    .01107997   .01050802   .01168306    .02745504    .0177111   .04255972 |
      73. |    13 April        72    .01194224   .01133033   .01258721       .02959   .01909005   .04586515 |
      74. |    14 April        73    .01279751   .01214612   .01348383    .03170737   .02045778   .04914302 |
      75. |    15 April        74     .0136411   .01295102   .01436795    .03379562   .02180685   .05237545 |
          |-------------------------------------------------------------------------------------------------|
      76. |    16 April        75    .01446898   .01374122   .01523527    .03584474   .02313081   .05554694 |
      77. |    17 April        76    .01527775   .01451352   .01608222    .03784636   .02442423   .05864452 |
      78. |    18 April        77    .01606466   .01526529    .0169059     .0397937   .02568273   .06165771 |
      79. |    19 April        78    .01682762   .01599451   .01770413    .04168155   .02690294   .06457851 |
      80. |    20 April        79    .01756513   .01669972   .01847538    .04350624   .02808247   .06740124 |
          |-------------------------------------------------------------------------------------------------|
      81. |    21 April        80    .01827625      .01738   .01921872    .04526552   .02921984   .07012246 |
      82. |    22 April        81    .01896062   .01803492   .01993383    .04695842   .03031441   .07274076 |
      83. |    23 April        82    .01961831   .01866451   .02062085    .04858522   .03136635   .07525656 |
      84. |    24 April        83    .02024986   .01926921   .02128042    .05014721   .03237646   .07767196 |
      85. |    25 April        84    .02085617   .01984984   .02191353    .05164667    .0333462   .07999048 |
          |-------------------------------------------------------------------------------------------------|
      86. |    26 April        85    .02143849   .02040751   .02252155    .05308667   .03427754   .08221692 |
      87. |    27 April        86    .02199832   .02094363   .02310612    .05447097   .03517291   .08435716 |
      88. |    28 April        87    .02253743   .02145986   .02366912    .05580394    .0360351   .08641795 |
      89. |    29 April        88    .02305778   .02195802   .02421261    .05709042   .03686725   .08840682 |
      90. |    30 April        89    .02356147   .02244013   .02473885    .05833565   .03767273   .09033188 |
          |-------------------------------------------------------------------------------------------------|
      91. |       1 May        90    .02405035   .02290793   .02524975    .05954419   .03845448   .09220019 |
      92. |       2 May        91    .02452473   .02336174   .02574562     .0607168   .03921301   .09401291 |
      93. |       3 May        92    .02498456   .02380153   .02622639    .06185338   .03994824   .09576992 |
      94. |       4 May        93    .02542985   .02422732   .02669207    .06295396    .0406602   .09747125 |
      95. |       5 May        94    .02586066    .0246392   .02714268     .0640187   .04134899   .09911714 |
          |-------------------------------------------------------------------------------------------------|
      96. |       6 May        95    .02627709   .02503726   .02757832    .06504783   .04201476   .10070795 |
      97. |       7 May        96    .02667928   .02542166   .02799911     .0660417   .04265773   .10224423 |
      98. |       8 May        97    .02706739   .02579257   .02840522    .06700075   .04327819   .10372663 |
      99. |       9 May        98    .02744163   .02615018   .02879685    .06792548   .04387646   .10515595 |
     100. |      10 May        99    .02780223   .02649474   .02917423    .06881645    .0444529   .10653306 |
          |-------------------------------------------------------------------------------------------------|
     101. |      11 May       100    .02814944    .0268265   .02953761    .06967431   .04500795   .10785896 |
     102. |      12 May       101    .02848354   .02714572   .02988729    .07049975   .04554202    .1091347 |
     103. |      13 May       102    .02880483    .0274527   .03022355     .0712935   .04605561   .11036143 |
     104. |      14 May       103    .02911362   .02774774   .03054673    .07205633   .04654921   .11154034 |
     105. |      15 May       104    .02941023   .02803115   .03085715    .07278905   .04702334   .11267269 |
          |-------------------------------------------------------------------------------------------------|
     106. |      16 May       105      .029695   .02830326   .03115517     .0734925   .04747854   .11375976 |
     107. |      17 May       106    .02996828   .02856441   .03144114    .07416753   .04791537   .11480288 |
     108. |      18 May       107    .03023041   .02881493   .03171544    .07481503   .04833439   .11580343 |
     109. |      19 May       108    .03048177   .02905516   .03197843    .07543588   .04873619   .11676276 |
     110. |      20 May       109    .03072272   .02928546   .03223051    .07603098   .04912133   .11768228 |
          |-------------------------------------------------------------------------------------------------|
     111. |      21 May       110    .03095361   .02950618   .03247204    .07660124   .04949041   .11856339 |
     112. |      22 May       111    .03117482   .02971767   .03270342    .07714758   .04984401    .1194075 |
     113. |      23 May       112    .03138672   .02992027   .03292503    .07767089   .05018272   .12021601 |
     114. |      24 May       113    .03158966   .03011434   .03313726    .07817208   .05050713   .12099033 |
     115. |      25 May       114    .03178402   .03030022   .03334049    .07865207   .05081782   .12173186 |
          |-------------------------------------------------------------------------------------------------|
     116. |      26 May       115    .03197016   .03047825   .03353509    .07911173   .05111536   .12244196 |
     117. |      27 May       116    .03214843   .03064879   .03372145    .07955195   .05140033   .12312203 |
     118. |      28 May       117    .03231918   .03081215   .03389993    .07997361   .05167329   .12377339 |
     119. |      29 May       118    .03248277   .03096868    .0340709    .08037757    .0519348   .12439739 |
     120. |      30 May       119    .03263954   .03111869   .03423472    .08076467   .05218541   .12499534 |
          |-------------------------------------------------------------------------------------------------|
     121. |      31 May       120    .03278982   .03126251   .03439176    .08113575   .05242564   .12556852 |
     122. |      1 June       121    .03293395   .03140045   .03454234    .08149162   .05265603    .1261182 |
     123. |      2 June       122    .03307224   .03153281   .03468682    .08183308    .0528771   .12664561 |
     124. |      3 June       123    .03320502   .03165991   .03482553    .08216092   .05308936   .12715197 |
     125. |      4 June       124    .03333259   .03178202    .0349588    .08247589   .05329329   .12763845 |
          |-------------------------------------------------------------------------------------------------|
     126. |      5 June       125    .03345525   .03189944   .03508694    .08277875   .05348938   .12810622 |
     127. |      6 June       126    .03357331   .03201245   .03521026    .08307023    .0536781    .1285564 |
     128. |      7 June       127    .03368704   .03212133   .03532907    .08335103   .05385991   .12899009 |
     129. |      8 June       128    .03379673   .03222632   .03544366    .08362184   .05403525   .12940835 |
     130. |      9 June       129    .03390265   .03232771   .03555432    .08388335   .05420457   .12981223 |
          |-------------------------------------------------------------------------------------------------|
     131. |     10 June       130    .03400507   .03242573   .03566133    .08413619   .05436828   .13020274 |
     132. |     11 June       131    .03410423   .03252063   .03576495    .08438102    .0545268   .13058086 |
     133. |     12 June       132     .0342004   .03261265   .03586546    .08461844   .05468052   .13094755 |
     134. |     13 June       133    .03429382   .03270202    .0359631    .08484906   .05482984   .13130373 |
     135. |     14 June       134    .03438471   .03278896   .03605812    .08507345   .05497512    .1316503 |
          |-------------------------------------------------------------------------------------------------|
     136. |     15 June       135    .03447331   .03287369   .03615077    .08529218   .05511674   .13198814 |
     137. |     16 June       136    .03455985   .03295643   .03624128     .0855058   .05525504   .13231808 |
     138. |     17 June       137    .03464452   .03303737   .03632986    .08571483   .05539038   .13264095 |
     139. |     18 June       138    .03472755   .03311671   .03641675     .0859198   .05552308   .13295754 |
     140. |     19 June       139    .03480913   .03319465   .03650214    .08612119   .05565345   .13326862 |
          |-------------------------------------------------------------------------------------------------|
     141. |     20 June       140    .03488946   .03327137   .03658625    .08631949   .05578183   .13357493 |
     142. |     21 June       141    .03496873   .03334705   .03666928    .08651516    .0559085   .13387719 |
     143. |     22 June       142    .03504712   .03342186   .03675141    .08670865   .05603376   .13417609 |
     144. |     23 June       143     .0351248   .03349598   .03683282    .08690041   .05615789   .13447232 |
     145. |     24 June       144    .03520195   .03356957   .03691371    .08709085   .05628116   .13476653 |
          +-------------------------------------------------------------------------------------------------+

. 
. twoway  (rarea _at1_lci _at1_uci date, color(red%25)) ///
>                  (rarea _at2_lci _at2_uci date if _at2_uci<1, color(blue%25)) ///
>                  (line _at1 date, sort lcolor(red)) ///
>                  (line _at2  date, sort lcolor(blue)) ///
>                  , legend(order(1 "No HIV" 2 "HIV") ring(0) cols(1) pos(1)) ///
>                  ylabel(0(0.05)0.15,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative mortality (%)") ///
>                  xtitle("Date in 2020")

. 
. graph export ./output/an_cumincidence.svg, as(svg) replace
(file ./output/an_cumincidence.svg written in SVG format)

.                                  
. log close
      name:  <unnamed>
       log:  e:\analyses\hiv-research\analysis\output/an_cumincidence.log
  log type:  text
 closed on:  28 Aug 2020, 20:06:32
----------------------------------------------------------------------------------------------------------------------------------
