----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\hiv-research\analysis\output/an_cumincidence.log
  log type:  text
 opened on:   1 Sep 2020, 08:50:37

. 
. use "cr_create_analysis_dataset_STSET_onsdeath_fail1", clear
(Analysis dataset HIV project)

. 
. *xi: stpm2 hiv i.ethnicity $adjustmentlist, df(3) scale(hazard) eform
. xi i.ethnicity i.male i.imd i.smoke_nomiss i.obese4cat 
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)

. stpm2 hiv age1 age2 age3 _I*, df(3) scale(hazard) eform 

Iteration 0:   log likelihood = -71012.872  
Iteration 1:   log likelihood = -71005.662  
Iteration 2:   log likelihood = -71005.652  
Iteration 3:   log likelihood = -71005.652  

Log likelihood = -71005.652                     Number of obs     = 12,745,732

-------------------------------------------------------------------------------
              |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
xb            |
          hiv |   2.550339   .5737221     4.16   0.000     1.641014    3.963542
         age1 |   1.171266   .0260433     7.11   0.000     1.121319    1.223439
         age2 |   .8935499   .0429131    -2.34   0.019     .8132788    .9817437
         age3 |   1.347249   .1491682     2.69   0.007     1.084432     1.67376
_Iethnicity_2 |   1.744646   .2000295     4.85   0.000     1.393523    2.184241
_Iethnicity_3 |   1.886905   .0748844    16.00   0.000     1.745697    2.039535
_Iethnicity_4 |   1.987405   .1184162    11.53   0.000     1.768353    2.233592
_Iethnicity_5 |   1.516979   .1342719     4.71   0.000     1.275373    1.804353
     _Imale_1 |   1.600559   .0314673    23.92   0.000     1.540058    1.663438
      _Iimd_2 |   1.186233   .0384074     5.27   0.000     1.113294     1.26395
      _Iimd_3 |   1.272759   .0409277     7.50   0.000     1.195017    1.355557
      _Iimd_4 |   1.654117   .0517127    16.10   0.000     1.555805    1.758641
      _Iimd_5 |    2.03319   .0635509    22.70   0.000     1.912371    2.161642
_Ismoke_nom_2 |   1.380351    .029464    15.10   0.000     1.323794    1.439324
_Ismoke_nom_3 |   1.191389   .0485041     4.30   0.000     1.100017    1.290351
_Iobese4cat_2 |   1.107662   .0290164     3.90   0.000     1.052226    1.166018
_Iobese4cat_3 |   1.594819   .0610508    12.19   0.000     1.479541     1.71908
_Iobese4cat_4 |   2.264578   .1211647    15.28   0.000     2.039127    2.514955
        _rcs1 |    2.36577   .0376913    54.05   0.000     2.293037    2.440809
        _rcs2 |   1.413333   .0109009    44.85   0.000     1.392128     1.43486
        _rcs3 |   .9847312   .0007347   -20.62   0.000     .9832922    .9861724
        _cons |   3.20e-08   2.59e-08   -21.31   0.000     6.54e-09    1.56e-07
-------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t | 17,308,294    143.6435    5.717096          1        144

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(17,308,622 missing values generated)

. stpm2_standsurv if hiv==1 & ethnicity<., at1(hiv 0) at2(hiv 1) timevar(timevar) ci contrast(difference) fail

. 
. gen date = d(1/2/2020)+ timevar
(17,308,622 missing values generated)

. format date %tddd_Month

. 
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci: replace X=100*X

->  replace _at1=100*_at1
(144 real changes made)

->  replace _at2=100*_at2
(144 real changes made)

->  replace _at1_lci=100*_at1_lci
(128 real changes made)

->  replace _at1_uci=100*_at1_uci
(128 real changes made)

->  replace _at2_lci=100*_at2_lci
(129 real changes made)

->  replace _at2_uci=100*_at2_uci
(129 real changes made)

. 
. l date timevar _at1 _at1_lci _at1_uci _at2 _at2_lci _at2_uci if timevar<.

          +-------------------------------------------------------------------------------------------------+
          |        date   timevar         _at1    _at1_lci    _at1_uci         _at2    _at2_lci    _at2_uci |
          |-------------------------------------------------------------------------------------------------|
       1. |  1 February         0            0           .           .            0           .           . |
       2. |  2 February         1   -6.040e-12           .           .   -5.906e-12           .           . |
       3. |  3 February         2   -6.040e-12           .           .   -5.906e-12           .           . |
       4. |  4 February         3   -6.040e-12           .           .   -5.906e-12           .           . |
       5. |  5 February         4   -6.040e-12           .           .   -5.906e-12           .           . |
          |-------------------------------------------------------------------------------------------------|
       6. |  6 February         5   -6.040e-12           .           .   -5.906e-12           .           . |
       7. |  7 February         6   -6.040e-12           .           .   -5.906e-12           .           . |
       8. |  8 February         7   -6.040e-12           .           .   -5.906e-12           .           . |
       9. |  9 February         8   -6.040e-12           .           .   -5.906e-12           .           . |
      10. | 10 February         9   -6.040e-12           .           .   -5.906e-12           .           . |
          |-------------------------------------------------------------------------------------------------|
      11. | 11 February        10   -6.040e-12           .           .   -5.906e-12           .           . |
      12. | 12 February        11   -6.040e-12           .           .   -5.884e-12           .           . |
      13. | 13 February        12   -6.040e-12           .           .   -5.884e-12           .           . |
      14. | 14 February        13   -5.995e-12           .           .   -5.729e-12           .           . |
      15. | 15 February        14   -5.773e-12           .           .   -5.151e-12           .           . |
          |-------------------------------------------------------------------------------------------------|
      16. | 16 February        15   -5.018e-12           .           .   -2.620e-12           .           . |
      17. | 17 February        16   -2.132e-12           .           .    4.663e-12   5.680e-13   3.828e-11 |
      18. | 18 February        17    5.462e-12   1.060e-12   2.816e-11    2.423e-11   8.274e-12   7.092e-11 |
      19. | 19 February        18    2.474e-11   1.009e-11   6.063e-11    7.149e-11   2.872e-11   1.779e-10 |
      20. | 20 February        19    6.929e-11   3.264e-11   1.471e-10    1.817e-10   7.732e-11   4.269e-10 |
          |-------------------------------------------------------------------------------------------------|
      21. | 21 February        20    1.678e-10   8.344e-11   3.373e-10    4.318e-10   1.905e-10   9.786e-10 |
      22. | 22 February        21    3.825e-10   1.977e-10   7.399e-10    9.778e-10   4.440e-10   2.153e-09 |
      23. | 23 February        22    8.344e-10   4.456e-10   1.562e-09    2.128e-09   9.919e-10   4.568e-09 |
      24. | 24 February        23    1.755e-09   9.654e-10   3.189e-09    4.475e-09   2.137e-09   9.374e-09 |
      25. | 25 February        24    3.574e-09   2.022e-09   6.315e-09    9.114e-09   4.451e-09   1.867e-08 |
          |-------------------------------------------------------------------------------------------------|
      26. | 26 February        25    7.071e-09   4.112e-09   1.216e-08    1.803e-08   8.995e-09   3.615e-08 |
      27. | 27 February        26    1.362e-08   8.128e-09   2.282e-08    3.473e-08   1.768e-08   6.825e-08 |
      28. | 28 February        27    2.559e-08   1.566e-08   4.183e-08    6.527e-08   3.385e-08   1.258e-07 |
      29. | 29 February        28    4.700e-08   2.946e-08   7.499e-08    1.199e-07   6.329e-08   2.270e-07 |
      30. |     1 March        29    8.450e-08   5.420e-08   1.317e-07    2.155e-07   1.157e-07   4.014e-07 |
          |-------------------------------------------------------------------------------------------------|
      31. |     2 March        30    1.489e-07   9.769e-08   2.270e-07    3.798e-07   2.071e-07   6.963e-07 |
      32. |     3 March        31    2.576e-07   1.727e-07   3.842e-07    6.569e-07   3.636e-07   1.187e-06 |
      33. |     4 March        32    4.374e-07   2.993e-07   6.390e-07    1.115e-06   6.261e-07   1.987e-06 |
      34. |     5 March        33    7.293e-07   5.093e-07   1.044e-06    1.860e-06   1.058e-06   3.271e-06 |
      35. |     6 March        34    1.195e-06   8.505e-07   1.678e-06    3.047e-06   1.754e-06   5.293e-06 |
          |-------------------------------------------------------------------------------------------------|
      36. |     7 March        35    1.923e-06   1.395e-06   2.651e-06    4.904e-06   2.854e-06   8.425e-06 |
      37. |     8 March        36    3.042e-06   2.246e-06   4.120e-06    7.759e-06   4.563e-06   .00001319 |
      38. |     9 March        37    4.734e-06   3.555e-06   6.302e-06    .00001207   7.168e-06   .00002033 |
      39. |    10 March        38    7.246e-06   5.532e-06   9.490e-06    .00001848   .00001107   .00003085 |
      40. |    11 March        39    .00001092   8.466e-06   .00001407    .00002784   .00001681    .0000461 |
          |-------------------------------------------------------------------------------------------------|
      41. |    12 March        40    .00001619   .00001275   .00002057     .0000413   .00002512   .00006788 |
      42. |    13 March        41    .00002366   .00001889   .00002963    .00006034   .00003696   .00009852 |
      43. |    14 March        42    .00003407   .00002758   .00004208    .00008688   .00005354   .00014099 |
      44. |    15 March        43    .00004836   .00003966   .00005897    .00012333   .00007642   .00019904 |
      45. |    16 March        44     .0000677   .00005621   .00008155    .00017266   .00010752   .00027727 |
          |-------------------------------------------------------------------------------------------------|
      46. |    17 March        45    .00009352   .00007855   .00011133     .0002385   .00014918   .00038129 |
      47. |    18 March        46     .0001275   .00010829   .00015012    .00032516   .00020421   .00051776 |
      48. |    19 March        47    .00017164    .0001473   .00019999    .00043772   .00027588   .00069451 |
      49. |    20 March        48    .00022822   .00019781   .00026332    .00058204     .000368   .00092058 |
      50. |    21 March        49    .00029986   .00026231    .0003428    .00076474   .00048487   .00120616 |
          |-------------------------------------------------------------------------------------------------|
      51. |    22 March        50    .00038944   .00034363   .00044137    .00099319   .00063127   .00156261 |
      52. |    23 March        51    .00050012   .00044486   .00056224    .00127543   .00081242   .00200231 |
      53. |    24 March        52    .00063526   .00056932   .00070883    .00162004   .00103389   .00253851 |
      54. |    25 March        53    .00079838    .0007205   .00088468    .00203602   .00130151   .00318507 |
      55. |    26 March        54     .0009931   .00090196   .00109344    .00253254   .00162122   .00395613 |
          |-------------------------------------------------------------------------------------------------|
      56. |    27 March        55    .00122298   .00111726   .00133871    .00311873   .00199894   .00486581 |
      57. |    28 March        56    .00149149    .0013698   .00162399    .00380338   .00244036    .0059277 |
      58. |    29 March        57    .00180184   .00166276   .00195255    .00459467   .00295075   .00715445 |
      59. |    30 March        58    .00215685    .0019989   .00232729    .00549981   .00353478   .00855722 |
      60. |    31 March        59    .00255887   .00238047   .00275064    .00652472   .00419626   .01014523 |
          |-------------------------------------------------------------------------------------------------|
      61. |     1 April        60    .00300959   .00280907   .00322443    .00767373   .00493796   .01192519 |
      62. |     2 April        61    .00350997   .00328555   .00374972    .00894924   .00576143   .01390086 |
      63. |     3 April        62    .00406011    .0038099   .00432676    .01035148    .0066668   .01607265 |
      64. |     4 April        63    .00465918   .00438121    .0049548    .01187831   .00765266   .01843726 |
      65. |     5 April        64    .00530534   .00499757   .00563207    .01352499   .00871596    .0209874 |
          |-------------------------------------------------------------------------------------------------|
      66. |     6 April        65    .00599571   .00565611   .00635571    .01528416   .00985192   .02371168 |
      67. |     7 April        66    .00672637   .00635298   .00712172     .0171458   .01105408   .02659458 |
      68. |     8 April        67    .00749238   .00708339   .00792499    .01909728   .01231428   .02961652 |
      69. |     9 April        68    .00828782   .00784166   .00875936     .0211235   .01362279    .0327541 |
      70. |    10 April        69    .00910589   .00862133   .00961769    .02320713   .01496843   .03598045 |
          |-------------------------------------------------------------------------------------------------|
      71. |    11 April        70    .00993904   .00941524   .01049198    .02532889   .01633878   .03926564 |
      72. |    12 April        71    .01077907   .01021566   .01137355     .0274679   .01772038   .04257729 |
      73. |    13 April        72    .01161793   .01101505   .01225381    .02960366   .01910001   .04588359 |
      74. |    14 April        73    .01244997   .01180809   .01312674     .0317218    .0204684   .04916225 |
      75. |    15 April        74    .01327065   .01259054    .0139875    .03381077   .02181811   .05239537 |
          |-------------------------------------------------------------------------------------------------|
      76. |    16 April        75    .01407605   .01335869   .01483192    .03586057   .02314269   .05556747 |
      77. |    17 April        76    .01486285   .01410943    .0156565    .03786282   .02443671   .05866557 |
      78. |    18 April        77    .01562839   .01484021   .01645844    .03981074   .02569578   .06167921 |
      79. |    19 April        78    .01637063   .01554907   .01723559    .04169913   .02691653   .06460036 |
      80. |    20 April        79    .01708809   .01623458   .01798648    .04352432   .02809658   .06742339 |
          |-------------------------------------------------------------------------------------------------|
      81. |    21 April        80     .0177799   .01689585   .01871021    .04528405   .02923444   .07014483 |
      82. |    22 April        81    .01844567   .01753246   .01940644    .04697737   .03032948    .0727633 |
      83. |    23 April        82    .01908549   .01814445   .02007534    .04860454   .03138185   .07527921 |
      84. |    24 April        83    .01969988   .01873224    .0207175    .05016688   .03239239   .07769467 |
      85. |    25 April        84    .02028972   .01929662   .02133392    .05166665   .03336253   .08001321 |
          |-------------------------------------------------------------------------------------------------|
      86. |    26 April        85     .0208562    .0198387    .0219259    .05310693   .03429424   .08223964 |
      87. |    27 April        86    .02140082   .02035982   .02249504    .05449149   .03518996   .08437983 |
      88. |    28 April        87    .02192528   .02086161   .02304318     .0558247   .03605249   .08644054 |
      89. |    29 April        88    .02243148   .02134584   .02357233     .0571114   .03688496   .08842931 |
      90. |    30 April        89    .02292148   .02181446   .02408468    .05835683   .03769075   .09035424 |
          |-------------------------------------------------------------------------------------------------|
      91. |       1 May        90    .02339707   .02226918   .02458209    .05956554    .0384728   .09222239 |
      92. |       2 May        91    .02385855   .02271029   .02506487    .06073831   .03923161   .09403495 |
      93. |       3 May        92    .02430588   .02313779   .02553294    .06187504   .03996712   .09579178 |
      94. |       4 May        93    .02473907   .02355168   .02598632    .06297576   .04067934   .09749291 |
      95. |       5 May        94    .02515816   .02395204   .02642503    .06404062   .04136837   .09913857 |
          |-------------------------------------------------------------------------------------------------|
      96. |       6 May        95    .02556327   .02433897   .02684915    .06506987   .04203438   .10072916 |
      97. |       7 May        96    .02595452   .02471262   .02725883    .06606384   .04267758    .1022652 |
      98. |       8 May        97    .02633208   .02507316    .0276542    .06702298   .04329825   .10374737 |
      99. |       9 May        98    .02669614   .02542078   .02803548    .06794779   .04389673   .10517644 |
     100. |      10 May        99    .02704693   .02575571   .02840289    .06883884   .04447338    .1065533 |
          |-------------------------------------------------------------------------------------------------|
     101. |      11 May       100     .0273847   .02607819   .02875667    .06969676   .04502861   .10787894 |
     102. |      12 May       101    .02770972   .02638849    .0290971    .07052226   .04556287   .10915443 |
     103. |      13 May       102    .02802227   .02668689   .02942447    .07131606   .04607663   .11038091 |
     104. |      14 May       103    .02832266   .02697368    .0297391    .07207893   .04657039   .11155956 |
     105. |      15 May       104     .0286112   .02724917   .03004132    .07281169   .04704468   .11269165 |
          |-------------------------------------------------------------------------------------------------|
     106. |      16 May       105    .02888823   .02751367   .03033146    .07351518   .04750003   .11377848 |
     107. |      17 May       106    .02915408   .02776751   .03060988    .07419024   .04793701   .11482136 |
     108. |      18 May       107    .02940909   .02801103   .03087692    .07483777   .04835617   .11582165 |
     109. |      19 May       108    .02965361   .02824455   .03113297    .07545864   .04875809   .11678075 |
     110. |      20 May       109      .029888   .02846841   .03137838    .07605377   .04914336   .11770004 |
          |-------------------------------------------------------------------------------------------------|
     111. |      21 May       110    .03011262   .02868296   .03161353    .07662405   .04951256   .11858092 |
     112. |      22 May       111    .03032781   .02888853    .0318388     .0771704   .04986628    .1194248 |
     113. |      23 May       112    .03053395   .02908547   .03205456    .07769372    .0502051    .1202331 |
     114. |      24 May       113    .03073137   .02927411   .03226118    .07819493   .05052961   .12100721 |
     115. |      25 May       114    .03092045   .02945479   .03245903    .07867493    .0508404   .12174853 |
          |-------------------------------------------------------------------------------------------------|
     116. |      26 May       115    .03110152   .02962785    .0326485     .0791346   .05113804   .12245844 |
     117. |      27 May       116    .03127495   .02979361   .03282993    .07957483    .0514231   .12313831 |
     118. |      28 May       117    .03144106   .02995241    .0330037     .0799965   .05169615   .12378949 |
     119. |      29 May       118     .0316002   .03010456   .03317016    .08040047   .05195775   .12441331 |
     120. |      30 May       119    .03175271   .03025037   .03332966    .08078757   .05220843   .12501108 |
          |-------------------------------------------------------------------------------------------------|
     121. |      31 May       120    .03189891   .03039017   .03348254    .08115866   .05244874    .1255841 |
     122. |      1 June       121    .03203911   .03052425   .03362916    .08151453   .05267921   .12613361 |
     123. |      2 June       122    .03217365   .03065292   .03376982      .081856   .05290035   .12666087 |
     124. |      3 June       123    .03230282   .03077646   .03390487    .08218384   .05311268   .12716708 |
     125. |      4 June       124    .03242692   .03089516   .03403462    .08249882   .05331667   .12765341 |
          |-------------------------------------------------------------------------------------------------|
     126. |      5 June       125    .03254625    .0310093   .03415938    .08280169   .05351283   .12812104 |
     127. |      6 June       126     .0326611   .03111915   .03427945    .08309317   .05370161   .12857109 |
     128. |      7 June       127    .03277174   .03122498   .03439513    .08337397   .05388348   .12900464 |
     129. |      8 June       128    .03287845   .03132704   .03450669    .08364479   .05405888   .12942278 |
     130. |      9 June       129     .0329815   .03142559   .03461443     .0839063   .05422826   .12982654 |
          |-------------------------------------------------------------------------------------------------|
     131. |     10 June       130    .03308113   .03152087   .03471862    .08415915   .05439203   .13021693 |
     132. |     11 June       131     .0331776   .03161312   .03481951    .08440398    .0545506   .13059493 |
     133. |     12 June       132    .03327116   .03170257   .03491736     .0846414   .05470437   .13096151 |
     134. |     13 June       133    .03336204   .03178944   .03501243    .08487202   .05485374   .13131758 |
     135. |     14 June       134    .03345047   .03187396   .03510495    .08509642   .05499907   .13166405 |
          |-------------------------------------------------------------------------------------------------|
     136. |     15 June       135    .03353666   .03195632   .03519515    .08531516   .05514074   .13200178 |
     137. |     16 June       136    .03362084   .03203675   .03528327    .08552878   .05527909   .13233163 |
     138. |     17 June       137    .03370322   .03211543   .03536952    .08573782   .05541447    .1326544 |
     139. |     18 June       138      .033784   .03219256   .03545411    .08594279   .05554721   .13297089 |
     140. |     19 June       139    .03386336   .03226832   .03553725    .08614418   .05567764   .13328187 |
          |-------------------------------------------------------------------------------------------------|
     141. |     20 June       140    .03394151    .0323429   .03561914    .08634248   .05580606   .13358809 |
     142. |     21 June       141    .03401863   .03241647   .03569997    .08653816   .05593277   .13389025 |
     143. |     22 June       142    .03409489   .03248919   .03577993    .08673166   .05605807   .13418906 |
     144. |     23 June       143    .03417046   .03256125    .0358592    .08692342   .05618225    .1344852 |
     145. |     24 June       144    .03424551   .03263278   .03593795    .08711386   .05630556   .13477931 |
          +-------------------------------------------------------------------------------------------------+

. 
. twoway  (rarea _at1_lci _at1_uci date, color(red%25)) ///
>                  (rarea _at2_lci _at2_uci date if _at2_uci<1, color(blue%25)) ///
>                  (line _at1 date, sort lcolor(red)) ///
>                  (line _at2  date, sort lcolor(blue)) ///
>                  , legend(order(1 "No HIV" 2 "HIV") ring(0) cols(1) pos(11)) ///
>                  ylabel(0(0.05)0.15,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative mortality (%)") ///
>                  xtitle("Date in 2020")

. 
. graph export ./output/an_cumincidence.svg, as(svg) replace
(file ./output/an_cumincidence.svg written in SVG format)

.                                  
. log close
      name:  <unnamed>
       log:  e:\analyses\hiv-research\analysis\output/an_cumincidence.log
  log type:  text
 closed on:   1 Sep 2020, 11:38:34
----------------------------------------------------------------------------------------------------------------------------------
