----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hiv-research\analysis\output/an_cumincidence.log
  log type:  text
 opened on:  11 Jul 2020, 18:25:27

. 
. use "cr_create_analysis_dataset.dta_STSET_onsdeath_fail1", clear
(Analysis dataset HIV project)

. 
. *xi: stpm2 hiv i.ethnicity $adjustmentlist, df(3) scale(hazard) eform
. xi i.ethnicity $adjustmentlist 
i.ethnicity       _Iethnicity_1-5     (naturally coded; _Iethnicity_1 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.chronic_res~e   _Ichronic_r_0-1     (naturally coded; _Ichronic_r_0 omitted)
i.asthmacat       _Iasthmacat_1-3     (naturally coded; _Iasthmacat_1 omitted)
i.chronic_car~e   _Ichronic_c_0-1     (naturally coded; _Ichronic_c_0 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.cancer_exha~t   _Icancer_ex_1-4     (naturally coded; _Icancer_ex_1 omitted)
i.cancer_haem~t   _Icancer_ha_1-4     (naturally coded; _Icancer_ha_1 omitted)
i.chronic_liv~e   _Ichronic_l_0-1     (naturally coded; _Ichronic_l_0 omitted)
i.stroke_deme~a   _Istroke_de_0-1     (naturally coded; _Istroke_de_0 omitted)
i.other_neuro     _Iother_neu_0-1     (naturally coded; _Iother_neu_0 omitted)
i.reduced_kid~t   _Ireduced_k_1-3     (naturally coded; _Ireduced_k_1 omitted)
i.organ_trans~t   _Iorgan_tra_0-1     (naturally coded; _Iorgan_tra_0 omitted)
i.spleen          _Ispleen_0-1        (naturally coded; _Ispleen_0 omitted)
i.ra_sle_psor~s   _Ira_sle_ps_0-1     (naturally coded; _Ira_sle_ps_0 omitted)
i.other_imm_e~v   _Iother_imm_0-1     (naturally coded; _Iother_imm_0 omitted)

. stpm2 hiv age1 age2 age3 _I*, df(3) scale(hazard) eform 

Iteration 0:   log likelihood = -68454.331  
Iteration 1:   log likelihood = -68439.595  
Iteration 2:   log likelihood = -68439.503  
Iteration 3:   log likelihood = -68439.503  

Log likelihood = -68439.503                     Number of obs     = 12,724,742

-------------------------------------------------------------------------------
              |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
xb            |
          hiv |   2.287898   .5148965     3.68   0.000     1.471878    3.556325
         age1 |   1.189762   .0273588     7.56   0.000      1.13733    1.244611
         age2 |   .8409781   .0416859    -3.49   0.000     .7631185    .9267816
         age3 |   1.532096   .1749445     3.74   0.000     1.224871     1.91638
_Iethnicity_2 |   1.664486   .1910056     4.44   0.000     1.329235    2.084292
_Iethnicity_3 |   1.601036   .0649734    11.60   0.000     1.478623    1.733583
_Iethnicity_4 |   1.760842   .1062908     9.37   0.000     1.564367    1.981992
_Iethnicity_5 |   1.497898   .1322657     4.58   0.000     1.259854    1.780918
     _Imale_1 |   1.450889   .0290586    18.58   0.000     1.395039    1.508976
_Iobese4cat_2 |   .9919482   .0263965    -0.30   0.761      .941538    1.045057
_Iobese4cat_3 |   1.340613   .0521376     7.54   0.000     1.242222    1.446796
_Iobese4cat_4 |   1.797796   .0980477    10.76   0.000      1.61554    2.000613
_Ismoke_nom_2 |    1.20109   .0262554     8.38   0.000     1.150717    1.253668
_Ismoke_nom_3 |   .9914936   .0412129    -0.21   0.837     .9139206    1.075651
      _Iimd_2 |   1.158439   .0376279     4.53   0.000     1.086988    1.234587
      _Iimd_3 |   1.215223    .039248     6.04   0.000     1.140683    1.294635
      _Iimd_4 |   1.534692   .0482318    13.63   0.000     1.443012    1.632197
      _Iimd_5 |   1.798358   .0566937    18.62   0.000     1.690603     1.91298
_Ihypertens_1 |   .9997202    .022144    -0.01   0.990     .9572473    1.044078
_Ichronic_r_1 |   1.654718   .0407028    20.47   0.000     1.576834    1.736448
_Iasthmacat_2 |   .9414607   .0287807    -1.97   0.048     .8867082     .999594
_Iasthmacat_3 |   1.081277   .0594578     1.42   0.155     .9708016    1.204323
_Ichronic_c_1 |   1.174259   .0250428     7.53   0.000     1.126187    1.224382
  _Idiabcat_2 |   1.317569   .0324222    11.21   0.000     1.255531    1.382672
  _Idiabcat_3 |   1.841754    .058997    19.07   0.000     1.729677    1.961093
  _Idiabcat_4 |   1.915003   .0942152    13.21   0.000     1.738968    2.108858
_Icancer_ex_2 |   1.733027   .1177504     8.09   0.000     1.516948    1.979886
_Icancer_ex_3 |   1.226803   .0580068     4.32   0.000     1.118221    1.345929
_Icancer_ex_4 |   1.001912   .0312262     0.06   0.951     .9425417    1.065022
_Icancer_ha_2 |   2.758649   .4229779     6.62   0.000     2.042601    3.725713
_Icancer_ha_3 |   2.366277   .2221778     9.17   0.000     1.968536    2.844381
_Icancer_ha_4 |   1.613346   .1229488     6.28   0.000     1.389504    1.873248
_Ichronic_l_1 |   1.925706   .1381489     9.13   0.000     1.673114    2.216433
_Istroke_de_1 |   2.162499   .0512909    32.52   0.000     2.064271      2.2654
_Iother_neu_1 |   2.631224    .104091    24.46   0.000     2.434918    2.843356
_Ireduced_k_2 |   1.293135   .0292905    11.35   0.000     1.236982    1.351836
_Ireduced_k_3 |   2.373659    .091784    22.36   0.000     2.200413    2.560544
_Iorgan_tra_1 |   3.146464   .4078328     8.84   0.000     2.440581    4.056508
   _Ispleen_1 |    1.15376   .1903749     0.87   0.386      .834957    1.594289
_Ira_sle_ps_1 |   1.159788   .0392503     4.38   0.000     1.085354    1.239325
_Iother_imm_1 |   3.258392   .7147461     5.39   0.000     2.119765    5.008631
        _rcs1 |   2.381088   .0384055    53.79   0.000     2.306992    2.457564
        _rcs2 |    1.40915   .0108488    44.55   0.000     1.388046    1.430574
        _rcs3 |   .9855017   .0007197   -20.00   0.000     .9840921    .9869133
        _cons |   2.47e-08   2.07e-08   -20.89   0.000     4.77e-09    1.28e-07
-------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t | 17,282,435    141.6546    5.584015          1        142

. local tmax = r(max)

. local tmaxplus1 = r(max) + 1

. 
. range timevar 0 `tmax' `tmaxplus1'
(17,282,762 missing values generated)

. stpm2_standsurv if hiv==1, at1(hiv 0) at2(hiv 1) timevar(timevar) ci contrast(difference) fail

. 
. gen date = d(1/2/2020)+ timevar
(17,282,762 missing values generated)

. format date %tddd_Month

. 
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci: replace X = 100*X

->  replace _at1 = 100*_at1
(142 real changes made)

->  replace _at2 = 100*_at2
(142 real changes made)

->  replace _at1_lci = 100*_at1_lci
(127 real changes made)

->  replace _at1_uci = 100*_at1_uci
(127 real changes made)

->  replace _at2_lci = 100*_at2_lci
(128 real changes made)

->  replace _at2_uci = 100*_at2_uci
(128 real changes made)

. 
. l date timevar _at1 _at1_lci _at1_uci _at2 _at2_lci _at2_uci if timevar<.

          +-------------------------------------------------------------------------------------------------+
          |        date   timevar         _at1    _at1_lci    _at1_uci         _at2    _at2_lci    _at2_uci |
          |-------------------------------------------------------------------------------------------------|
       1. |  1 February         0            0           .           .            0           .           . |
       2. |  2 February         1   -7.105e-13           .           .   -7.105e-13           .           . |
       3. |  3 February         2   -7.105e-13           .           .   -7.105e-13           .           . |
       4. |  4 February         3   -7.105e-13           .           .   -7.105e-13           .           . |
       5. |  5 February         4   -7.105e-13           .           .   -7.105e-13           .           . |
          |-------------------------------------------------------------------------------------------------|
       6. |  6 February         5   -7.105e-13           .           .   -7.105e-13           .           . |
       7. |  7 February         6   -7.105e-13           .           .   -7.105e-13           .           . |
       8. |  8 February         7   -7.105e-13           .           .   -7.105e-13           .           . |
       9. |  9 February         8   -7.105e-13           .           .   -7.105e-13           .           . |
      10. | 10 February         9   -7.105e-13           .           .   -7.105e-13           .           . |
          |-------------------------------------------------------------------------------------------------|
      11. | 11 February        10   -7.105e-13           .           .   -7.105e-13           .           . |
      12. | 12 February        11   -7.105e-13           .           .   -7.105e-13           .           . |
      13. | 13 February        12   -7.105e-13           .           .   -7.105e-13           .           . |
      14. | 14 February        13   -7.105e-13           .           .   -6.883e-13           .           . |
      15. | 15 February        14   -6.439e-13           .           .   -5.773e-13           .           . |
          |-------------------------------------------------------------------------------------------------|
      16. | 16 February        15   -4.885e-13           .           .    9.992e-14   7.208e-27   1.3851506 |
      17. | 17 February        16    4.441e-13   2.371e-16   8.317e-10    3.453e-12   2.855e-13   4.175e-11 |
      18. | 18 February        17    4.685e-12   7.108e-13   3.088e-11    1.638e-11   4.028e-12   6.657e-11 |
      19. | 19 February        18    1.982e-11   6.525e-12   6.019e-11    5.610e-11   1.999e-11   1.574e-10 |
      20. | 20 February        19    6.189e-11   2.668e-11   1.436e-10    1.564e-10   6.445e-11   3.796e-10 |
          |-------------------------------------------------------------------------------------------------|
      21. | 21 February        20    1.627e-10   7.895e-11   3.354e-10    3.827e-10   1.670e-10   8.770e-10 |
      22. | 22 February        21    3.804e-10   1.947e-10   7.435e-10    8.751e-10   3.946e-10   1.941e-09 |
      23. | 23 February        22    8.369e-10   4.435e-10   1.579e-09    1.917e-09   8.879e-10   4.138e-09 |
      24. | 24 February        23    1.770e-09   9.670e-10   3.240e-09    4.052e-09   1.924e-09   8.533e-09 |
      25. | 25 February        24    3.625e-09   2.039e-09   6.445e-09    8.295e-09   4.031e-09   1.707e-08 |
          |-------------------------------------------------------------------------------------------------|
      26. | 26 February        25    7.206e-09   4.166e-09   1.247e-08    1.649e-08   8.188e-09   3.320e-08 |
      27. | 27 February        26    1.394e-08   8.274e-09   2.349e-08    3.190e-08   1.617e-08   6.293e-08 |
      28. | 28 February        27    2.631e-08   1.601e-08   4.323e-08    6.019e-08   3.110e-08   1.165e-07 |
      29. | 29 February        28    4.852e-08   3.026e-08   7.780e-08    1.110e-07   5.840e-08   2.110e-07 |
      30. |     1 March        29    8.757e-08   5.591e-08   1.372e-07    2.003e-07   1.072e-07   3.744e-07 |
          |-------------------------------------------------------------------------------------------------|
      31. |     2 March        30    1.549e-07   1.012e-07   2.372e-07    3.544e-07   1.927e-07   6.518e-07 |
      32. |     3 March        31    2.689e-07   1.795e-07   4.029e-07    6.153e-07   3.397e-07   1.115e-06 |
      33. |     4 March        32    4.583e-07   3.124e-07   6.723e-07    1.049e-06   5.871e-07   1.873e-06 |
      34. |     5 March        33    7.669e-07   5.335e-07   1.102e-06    1.754e-06   9.954e-07   3.092e-06 |
      35. |     6 March        34    1.260e-06   8.940e-07   1.777e-06    2.883e-06   1.656e-06   5.020e-06 |
          |-------------------------------------------------------------------------------------------------|
      36. |     7 March        35    2.035e-06   1.471e-06   2.815e-06    4.656e-06   2.705e-06   8.014e-06 |
      37. |     8 March        36    3.230e-06   2.377e-06   4.389e-06    7.390e-06   4.339e-06   .00001259 |
      38. |     9 March        37    5.041e-06   3.774e-06   6.732e-06    .00001153   6.838e-06   .00001945 |
      39. |    10 March        38    7.738e-06   5.891e-06   .00001016     .0000177   .00001059   .00002959 |
      40. |    11 March        39    .00001169   9.041e-06   .00001511    .00002675   .00001613   .00004434 |
          |-------------------------------------------------------------------------------------------------|
      41. |    12 March        40    .00001739   .00001365   .00002214    .00003978   .00002418   .00006546 |
      42. |    13 March        41    .00002547   .00002029   .00003197    .00005827   .00003566   .00009523 |
      43. |    14 March        42    .00003677   .00002969   .00004552    .00008412   .00005179   .00013661 |
      44. |    15 March        43    .00005231   .00004281   .00006393    .00011969   .00007411    .0001933 |
      45. |    16 March        44    .00007341   .00006082    .0000886    .00016794   .00010452   .00026986 |
          |-------------------------------------------------------------------------------------------------|
      46. |    17 March        45    .00010162   .00008518   .00012122    .00023248   .00014534   .00037188 |
      47. |    18 March        46    .00013883   .00011769   .00016378    .00031763   .00019938     .000506 |
      48. |    19 March        47    .00018727   .00016043   .00021861    .00042844   .00026992   .00068006 |
      49. |    20 March        48     .0002495   .00021586   .00028838     .0005708   .00036077   .00090309 |
      50. |    21 March        49    .00032842    .0002868   .00037609    .00075135   .00047625   .00118536 |
          |-------------------------------------------------------------------------------------------------|
      51. |    22 March        50    .00042729    .0003764   .00048506    .00097752   .00062118   .00153829 |
      52. |    23 March        51    .00054966   .00048814   .00061892    .00125742   .00080082   .00197436 |
      53. |    24 March        52    .00069931   .00062575   .00078152    .00159974   .00102082   .00250697 |
      54. |    25 March        53    .00088025   .00079316   .00097689    .00201357   .00128708   .00315013 |
      55. |    26 March        54    .00109654   .00099442   .00120916    .00250825   .00160565   .00391822 |
          |-------------------------------------------------------------------------------------------------|
      56. |    27 March        55    .00135227   .00123353   .00148245    .00309305   .00198256   .00482557 |
      57. |    28 March        56    .00165138    .0015144   .00180075    .00377698   .00242362   .00588604 |
      58. |    29 March        57    .00199753   .00184062   .00216781    .00456837   .00293426   .00711252 |
      59. |    30 March        58    .00239397   .00221537   .00258698    .00547463   .00351926   .00851644 |
      60. |    31 March        59    .00284342   .00264125   .00306107    .00650188   .00418259   .01010725 |
          |-------------------------------------------------------------------------------------------------|
      61. |     1 April        60    .00334786   .00312012   .00359221    .00765461   .00492715   .01189187 |
      62. |     2 April        61    .00390843   .00365302    .0041817    .00893537    .0057546   .01387424 |
      63. |     3 April        62    .00452534   .00424001   .00482987    .01034451   .00666518   .01605489 |
      64. |     4 April        63    .00519769   .00488011   .00553594    .01187994   .00765756   .01843055 |
      65. |     5 April        64    .00592349   .00557127   .00629798    .01353698   .00872871   .02099393 |
          |-------------------------------------------------------------------------------------------------|
      66. |     6 April        65    .00669953   .00631029   .00711278    .01530825   .00987388   .02373356 |
      67. |     7 April        66    .00752144    .0070929   .00797587    .01718364   .01108659   .02663376 |
      68. |     8 April        67    .00838366   .00791371   .00888152    .01915042   .01235861   .02967474 |
      69. |     9 April        68    .00927954   .00876637   .00982275    .02119333   .01368012   .03283284 |
      70. |    10 April        69    .01020143    .0096436   .01079152    .02329484   .01503981   .03608087 |
          |-------------------------------------------------------------------------------------------------|
      71. |    11 April        70    .01114077   .01053733   .01177877    .02543545   .01642511   .03938859 |
      72. |    12 April        71    .01208831   .01143884   .01277466    .02759401   .01782236   .04272327 |
      73. |    13 April        72    .01303494   .01233958   .01376948    .02974976   .01921814   .04605276 |
      74. |    14 April        73    .01397422   .01323354   .01475636     .0318881   .02060302   .04935448 |
      75. |    15 April        74    .01490099   .01411587   .01572978    .03399726   .02196936   .05261025 |
          |-------------------------------------------------------------------------------------------------|
      76. |    16 April        75    .01581075   .01498233   .01668496    .03606705   .02331057   .05580438 |
      77. |    17 April        76     .0166997   .01582935    .0176179     .0380889   .02462107   .05892367 |
      78. |    18 April        77    .01756478   .01665401   .01852536    .04005586   .02589634   .06195748 |
      79. |    19 April        78    .01840362   .01745402   .01940488    .04196261   .02713289   .06489764 |
      80. |    20 April        79    .01921452   .01822773   .02025472    .04380534   .02832822   .06773838 |
          |-------------------------------------------------------------------------------------------------|
      81. |    21 April        80    .01999641   .01897408   .02107382    .04558169   .02948077   .07047614 |
      82. |    22 April        81    .02074883   .01969256   .02186175    .04729065   .03058983   .07310945 |
      83. |    23 April        82    .02147183   .02038316   .02261865    .04893239   .03165549   .07563866 |
      84. |    24 April        83    .02216595   .02104631   .02334515    .05050819   .03267854   .07806582 |
      85. |    25 April        84    .02283214   .02168288   .02404232    .05202025   .03366038   .08039442 |
          |-------------------------------------------------------------------------------------------------|
      86. |    26 April        85    .02347173   .02229406   .02471162    .05347164   .03460296   .08262924 |
      87. |    27 April        86    .02408637   .02288137   .02535482    .05486611    .0355087   .08477612 |
      88. |    28 April        87    .02467794   .02344659   .02597395      .056208   .03638039    .0868418 |
      89. |    29 April        88    .02524857   .02399172   .02657128    .05750216   .03722117   .08883379 |
      90. |    30 April        89    .02580057   .02451892   .02714922    .05875383   .03803443   .09076019 |
          |-------------------------------------------------------------------------------------------------|
      91. |       1 May        90    .02633593    .0250301    .0277099    .05996757   .03882311   .09262805 |
      92. |       2 May        91    .02685501   .02552561   .02825364    .06114419   .03958774   .09443863 |
      93. |       3 May        92    .02735777   .02600545    .0287804    .06228364   .04032827   .09619187 |
      94. |       4 May        93    .02784424   .02646967    .0292902    .06338602   .04104478   .09788791 |
      95. |       5 May        94    .02831451   .02691835   .02978309    .06445152   .04173737   .09952708 |
          |-------------------------------------------------------------------------------------------------|
      96. |       6 May        95    .02876871   .02735164    .0302592    .06548046   .04240625   .10110987 |
      97. |       7 May        96    .02920701   .02776971   .03071869    .06647325   .04305169   .10263692 |
      98. |       8 May        97    .02962962   .02817279   .03116177    .06743037   .04367399     .104109 |
      99. |       9 May        98    .03003679   .02856112   .03158869    .06835241   .04427352   .10552699 |
     100. |      10 May        99    .03042879   .02893497   .03199973       .06924    .0448507   .10689191 |
          |-------------------------------------------------------------------------------------------------|
     101. |      11 May       100    .03080594   .02929465   .03239519    .07009384   .04540598   .10820483 |
     102. |      12 May       101    .03116855   .02964047   .03277542     .0709147   .04593985   .10946693 |
     103. |      13 May       102    .03151698   .02997276   .03314076    .07170337   .04645283   .11067944 |
     104. |      14 May       103     .0318516    .0302919   .03349161    .07246069   .04694545   .11184368 |
     105. |      15 May       104    .03217278   .03059824   .03382836    .07318753   .04741828   .11296097 |
          |-------------------------------------------------------------------------------------------------|
     106. |      16 May       105    .03248093   .03089216    .0341514     .0738848    .0478719   .11403273 |
     107. |      17 May       106    .03277643   .03117404   .03446118     .0745534   .04830691   .11506035 |
     108. |      18 May       107     .0330597   .03144429   .03475811    .07519428    .0487239    .1160453 |
     109. |      19 May       108    .03333116   .03170329   .03504262    .07580839   .04912351   .11698904 |
     110. |      20 May       109    .03359123   .03195145   .03531517    .07639668   .04950634   .11789304 |
          |-------------------------------------------------------------------------------------------------|
     111. |      21 May       110    .03384033   .03218916   .03557619     .0769601   .04987301   .11875878 |
     112. |      22 May       111    .03407887   .03241684   .03582612    .07749963   .05022415   .11958774 |
     113. |      23 May       112    .03430729   .03263488   .03606541    .07801621   .05056038   .12038141 |
     114. |      24 May       113    .03452601   .03284368   .03629451    .07851081   .05088232   .12114124 |
     115. |      25 May       114    .03473542   .03304363   .03651384    .07898436   .05119058   .12186871 |
          |-------------------------------------------------------------------------------------------------|
     116. |      26 May       115    .03493596   .03323512   .03672384    .07943781   .05148576   .12256525 |
     117. |      27 May       116    .03512803   .03341855   .03692495    .07987207   .05176847   .12323228 |
     118. |      28 May       117    .03531202   .03359428   .03711759    .08028805    .0520393   .12387122 |
     119. |      29 May       118    .03548834   .03376271   .03730217    .08068667   .05229883   .12448344 |
     120. |      30 May       119    .03565737   .03392418    .0374791    .08106878   .05254763    .1250703 |
          |-------------------------------------------------------------------------------------------------|
     121. |      31 May       120    .03581949   .03407908   .03764879    .08143527   .05278626   .12563313 |
     122. |      1 June       121    .03597508   .03422774   .03781163    .08178697   .05301528   .12617324 |
     123. |      2 June       122    .03612451   .03437051   .03796801    .08212472   .05323521   .12669189 |
     124. |      3 June       123    .03626812   .03450774    .0381183    .08244932    .0534466   .12719034 |
     125. |      4 June       124    .03640627   .03463976   .03826287    .08276157   .05364994   .12766981 |
          |-------------------------------------------------------------------------------------------------|
     126. |      5 June       125     .0365393   .03476688   .03840209    .08306223   .05384574   .12813147 |
     127. |      6 June       126    .03666755   .03488942    .0385363    .08335206    .0540345   .12857649 |
     128. |      7 June       127    .03679133   .03500769   .03866584    .08363179   .05421667   .12900599 |
     129. |      8 June       128    .03691095   .03512198   .03879105    .08390212   .05439274   .12942106 |
     130. |      9 June       129    .03702673   .03523259   .03891224    .08416375   .05456313   .12982277 |
          |-------------------------------------------------------------------------------------------------|
     131. |     10 June       130    .03713896   .03533979   .03902973    .08441735    .0547283   .13021214 |
     132. |     11 June       131    .03724793   .03544386   .03914382    .08466358   .05488867   .13059019 |
     133. |     12 June       132    .03735392   .03554507   .03925482    .08490306   .05504464   .13095788 |
     134. |     13 June       133    .03745719   .03564367   .03936299    .08513641   .05519662   .13131616 |
     135. |     14 June       134    .03755802   .03573991   .03946863    .08536422   .05534499   .13166593 |
          |-------------------------------------------------------------------------------------------------|
     136. |     15 June       135    .03765666   .03583403   .03957199    .08558707   .05549013    .1320081 |
     137. |     16 June       136    .03775335   .03592627   .03967334    .08580552    .0556324   .13234351 |
     138. |     17 June       137    .03784833   .03601686   .03977293     .0860201   .05577215   .13267299 |
     139. |     18 June       138    .03794184   .03610602     .039871    .08623135   .05590973   .13299736 |
     140. |     19 June       139     .0380341   .03619396   .03996779    .08643977   .05604546   .13331738 |
          |-------------------------------------------------------------------------------------------------|
     141. |     20 June       140    .03812532   .03628088   .04006353    .08664585   .05617967   .13363382 |
     142. |     21 June       141    .03821573     .036367   .04015844    .08685007   .05631266    .1339474 |
     143. |     22 June       142    .03830551   .03645249   .04025272    .08705288   .05644473   .13425883 |
          +-------------------------------------------------------------------------------------------------+

. 
. twoway  (rarea _at1_lci _at1_uci date, color(red%25)) ///
>                  (rarea _at2_lci _at2_uci date if _at2_uci<1, color(blue%25)) ///
>                  (line _at1 date, sort lcolor(red)) ///
>                  (line _at2  date, sort lcolor(blue)) ///
>                  , legend(order(1 "No HIV" 2 "HIV") ring(0) cols(1) pos(1)) ///
>                  ylabel(0(0.05)0.15,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative mortality (%)") ///
>                  xtitle("Date in 2020")

. 
. graph export ./output/an_cumincidence.svg, as(svg) replace
(file ./output/an_cumincidence.svg written in SVG format)

.                                  
. log close
      name:  <unnamed>
       log:  E:\analyses\hiv-research\analysis\output/an_cumincidence.log
  log type:  text
 closed on:  11 Jul 2020, 22:15:08
----------------------------------------------------------------------------------------------------------------------------------
