----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\hiv-research\analysis\output/an_phcheck_addtimeinteractions_cc.log
  log type:  text
 opened on:  28 Aug 2020, 17:38:21

. 
. use "cr_create_analysis_dataset_STSET_onsdeath_fail1", clear
(Analysis dataset HIV project)

. 
. stsplit timeperiod, at(60)
(17,276,001 observations (episodes) created)

. 
. *gen anyreduced_kidney_function = reduced_kidney_function_cat>=2
. *gen anyobesity = obese4cat>=2
. gen highimd = imd>=3

. 
. 
. stcox   i.hiv i.ethnicity age1 age2 age3 i.male i.imd 60.timeperiod#2.ethnicity         ///
>         60.timeperiod#3.ethnicity                                                                                       ///
>         60.timeperiod#4.ethnicity                                                                                       ///
>         60.timeperiod#5.ethnicity                                                                                       ///
>         60.timeperiod#1.male                                                                                            ///
>         60.timeperiod#1.highimd                                                                                         ///     
>                 
>         , strata(stp)

         failure _d:  onsdeath == 1
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -147541.63
Iteration 1:   log likelihood =  -134570.5
Iteration 2:   log likelihood = -129695.73
Iteration 3:   log likelihood = -129434.81
Iteration 4:   log likelihood = -129422.51
Iteration 5:   log likelihood = -129421.31
Iteration 6:   log likelihood = -129421.28
Iteration 7:   log likelihood = -129421.28
Refining estimates:
Iteration 0:   log likelihood = -129421.28

Stratified Cox regr. -- Breslow method for ties

No. of subjects =   12,745,732                  Number of obs    =  25,468,648
No. of failures =       11,174
Time at risk    =   1830993197
                                                LR chi2(19)      =    36240.68
Log likelihood  =   -129421.28                  Prob > chi2      =      0.0000

--------------------------------------------------------------------------------------------
                        _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
                     1.hiv |   2.425056   .5453206     3.94   0.000     1.560675    3.768173
                           |
                 ethnicity |
                    Mixed  |   1.384124   .4435422     1.01   0.310     .7385969    2.593835
   Asian or Asian British  |   1.686059   .1805585     4.88   0.000     1.366842    2.079827
                    Black  |   1.860238   .2744454     4.21   0.000     1.393121    2.483982
                    Other  |   1.859992   .3658942     3.15   0.002     1.264924    2.735004
                           |
                      age1 |   1.166912   .0255186     7.06   0.000     1.117953    1.218015
                      age2 |   .9138171    .043261    -1.90   0.057     .8328419    1.002665
                      age3 |   1.260159   .1376943     2.12   0.034     1.017225    1.561112
                    1.male |   2.489178    .157913    14.38   0.000     2.198143    2.818746
                           |
                       imd |
                        2  |   1.225504   .0398404     6.26   0.000     1.149854    1.306131
                        3  |   1.209847    .086823     2.65   0.008     1.051103    1.392566
                        4  |   1.532612   .1093754     5.98   0.000     1.332557      1.7627
          5 most deprived  |   1.826135   .1310462     8.39   0.000     1.586534    2.101921
                           |
      timeperiod#ethnicity |
                 60#Mixed  |   1.028513   .3530972     0.08   0.935     .5247899     2.01574
60#Asian or Asian British  |   .7794764   .0903714    -2.15   0.032     .6210347    .9783406
                 60#Black  |   .7688157   .1244456    -1.62   0.104     .5598107    1.055853
                 60#Other  |   .5806268   .1282478    -2.46   0.014     .3766043     .895177
                           |
           timeperiod#male |
                     60 1  |   .6435923   .0427699    -6.63   0.000     .5649945    .7331239
                           |
        timeperiod#highimd |
                     60 1  |    1.15031   .0812041     1.98   0.047     1.001673    1.321004
--------------------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. 
. estat phtest, d

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.hiv      |            .            .        1             .
      1.hiv       |     -0.00930         0.96        1         0.3271
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.00080         0.01        1         0.9327
      3.ethnicity |      0.00136         0.02        1         0.8849
      4.ethnicity |      0.00155         0.03        1         0.8710
      5.ethnicity |     -0.00018         0.00        1         0.9852
      age1        |      0.00981         1.22        1         0.2696
      age2        |     -0.01332         2.20        1         0.1380
      age3        |      0.01620         3.22        1         0.0728
      0b.male     |            .            .        1             .
      1.male      |      0.00587         0.39        1         0.5348
      1b.imd      |            .            .        1             .
      2.imd       |      0.01703         3.24        1         0.0720
      3.imd       |      0.00685         0.51        1         0.4756
      4.imd       |      0.00457         0.23        1         0.6340
      5.imd       |      0.00325         0.11        1         0.7355
      60.timeper~y|     -0.00381         0.16        1         0.6874
      60.timeper~y|     -0.01238         1.73        1         0.1884
      60.timeper~y|     -0.00499         0.27        1         0.6000
      60.timeper~y|     -0.00226         0.06        1         0.8126
      60.timeper~e|     -0.01777         3.52        1         0.0605
      60.timeper~d|     -0.00196         0.04        1         0.8390
      ------------+---------------------------------------------------
      global test |                    193.64       19         0.0000
      ----------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  e:\analyses\hiv-research\analysis\output/an_phcheck_addtimeinteractions_cc.log
  log type:  text
 closed on:  28 Aug 2020, 19:39:49
----------------------------------------------------------------------------------------------------------------------------------
